#!/bin/bash
#Няколко потребители искат да работят заедно върху файлове в споделена директория, като членове на обща група (група-собственик на директорията).
#Изисквания:

#Всеки член на групата трябва да може да чете, пише, трие и създава файлове/директории в споделената директория и поддиректориите ѝ.
#Потребители извън групата нямат достъп до съдържанието изобщо.

#Напишете скрипт shared-dir.sh, който приема един аргумент (име на споделената директория, вече съществуваща, с правилна група-собственик):

#Ако изпълняващият е root — скриптът обхожда файловете и променя (при нужда) собствеността и правата им, така че да са изпълнени критериите
#(без да пипа "execute" бита за owner/group на обикновени файлове).
#Ако изпълняващият е извън групата — скриптът излиза с грешка.
#Ако изпълняващият е член на групата — скриптът трябва да настрои потребителската маска (umask) на текущата shell сесия, така че новосъздадените 
#файлове да имат правилни права, без да е нужно да се изпълнява като root след всяко създаване на файл.


if [[ -z "$1" || ! $# -eq 1 ]]; then
    exit 1
fi
if [[ ! -d "$1" ]]; then
    exit 1
fi
if [[ $(whoami) == "root" ]]; then
    find $1 -type d -exec chmod g+rwx,g+s,o-rwx {} +
    find $1 -type f -exec chmod g+rw,o-rwx {} +
elif ! id -G | grep -q -w "$(stat -c '%g' "$1")"; then
    exit 1
else
    umask 007
fi

